In [1]:
from poloniex import Poloniex

In [3]:
polo = Poloniex(key,secret)

### Real Time Data
--------------------------

In [4]:
real_time = polo.returnOrderBook('BTC_LTC',depth=1)

In [5]:
real_time

{'asks': [['0.01601206', '0.90419048']],
 'bids': [['0.01601205', '14.03880953']],
 'isFrozen': '0',
 'seq': 185838409}

In [6]:
real_time['asks'][0][0]

'0.01601206'

In [7]:
type(real_time['asks'][0][0])

str

## Connecting to your Database
-----------------------------------------------

In [8]:
from sqlalchemy import create_engine
import pandas as pd

In [9]:
engine = create_engine(mysqllogin).connect()

# mysqllogin = "mysql//user:password@localhost/database_name"

In [10]:
customers = pd.read_sql_table('customers',con = engine ,index_col=  'customer_id')

customers

                name last_name area_id  purchases
customer_id
1               John     Smith     nw1        200
2            Patrick    Stuart     ne1        300
3            Gonzalo    Rearte     se2        500
4             Maria      Jones     sw3        700
5               Tim     Maddoc     sw3        400
6              Steve      Jobs     se2        600
7              Alan     Norton     ne1        300
8               Pat    Collins     nw1        400

In [11]:
areas = pd.read_sql_table('areas',con = engine ,index_col=  'area_id')

areas

              state         city
area_id
ne1           Maine     Portland
nw1      Washington      Seattle
se2         Florida        Miami
sw3      California  Los Angeles

In [12]:
import pyodbc

In [19]:
conn = pyodbc.connect(mypyodbclogin)

In [20]:
sql = "SELECT * FROM demo_data.customers AS cus INNER JOIN	demo_data.areas as area ON cus.area_id = area.area_id"

In [21]:
data = pd.read_sql(sql,conn)

In [22]:
data

,customer_id,name,last_name,area_id,purchases,area_id,state,city
0,1,John,Smith,nw1,200,nw1,Washington,Seattle
1,2,Patrick,Stuart,ne1,300,ne1,Maine,Portland
2,3,Gonzalo,Rearte,se2,500,se2,Florida,Miami
3,4,Maria,Jones,sw3,700,sw3,California,Los Angeles
4,5,Tim,Maddoc,sw3,400,sw3,California,Los Angeles
5,6,Steve,Jobs,se2,600,se2,Florida,Miami
6,7,Alan,Norton,ne1,300,ne1,Maine,Portland
7,8,Pat,Collins,nw1,400,nw1,Washington,Seattle